{
  "tokenizer_class": "PreTrainedTokenizerFast",
  "unk_token": "<unk>",
  "pad_token": "<unk>",
  "bos_token": "<|im_start|>",
  "eos_token": "<|im_end|>",
  "add_bos_token": false,
  "add_eos_token": false,
  "clean_up_tokenization_spaces": false,
  "model_max_length": 32768,
  "chat_template": "{% if messages[0]['role'] == 'system' %}{{ '<|im_start|>system\n' + messages[0]['content'] + '<|im_end|>\n' }}{% else %}{{ '<|im_start|>system\nYou are a helpful assistant.<|im_end|>\n' }}{% endif %}{% for message in messages %}{% if message['role'] == 'user' %}{{ '<|im_start|>user\n' + message['content'] + '<|im_end|>\n<|im_start|>assistant\n' }}{% elif message['role'] == 'assistant' %}{{ message['content'] + '<|im_end|>\n' }}{% endif %}{% endfor %}"
}