{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|im_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<|im_start|>": 1,
      "<|im_end|>": 2,
      "!": 3,
      "\"": 4,
      "#": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "¡": 97,
      "¢": 98,
      "£": 99,
      "¤": 100,
      "¥": 101,
      "¦": 102,
      "§": 103,
      "¨": 104,
      "©": 105,
      "ª": 106,
      "«": 107,
      "¬": 108,
      "®": 109,
      "¯": 110,
      "°": 111,
      "±": 112,
      "²": 113,
      "³": 114,
      "´": 115,
      "µ": 116,
      "¶": 117,
      "·": 118,
      "¸": 119,
      "¹": 120,
      "º": 121,
      "»": 122,
      "¼": 123,
      "½": 124,
      "¾": 125,
      "¿": 126,
      "À": 127,
      "Á": 128,
      "Â": 129,
      "Ã": 130,
      "Ä": 131,
      "Å": 132,
      "Æ": 133,
      "Ç": 134,
      "È": 135,
      "É": 136,
      "Ê": 137,
      "Ë": 138,
      "Ì": 139,
      "Í": 140,
      "Î": 141,
      "Ï": 142,
      "Ð": 143,
      "Ñ": 144,
      "Ò": 145,
      "Ó": 146,
      "Ô": 147,
      "Õ": 148,
      "Ö": 149,
      "×": 150,
      "Ø": 151,
      "Ù": 152,
      "Ú": 153,
      "Û": 154,
      "Ü": 155,
      "Ý": 156,
      "Þ": 157,
      "ß": 158,
      "à": 159,
      "á": 160,
      "â": 161,
      "ã": 162,
      "ä": 163,
      "å": 164,
      "æ": 165,
      "ç": 166,
      "è": 167,
      "é": 168,
      "ê": 169,
      "ë": 170,
      "ì": 171,
      "í": 172,
      "î": 173,
      "ï": 174,
      "ð": 175,
      "ñ": 176,
      "ò": 177,
      "ó": 178,
      "ô": 179,
      "õ": 180,
      "ö": 181,
      "÷": 182,
      "ø": 183,
      "ù": 184,
      "ú": 185,
      "û": 186,
      "ü": 187,
      "ý": 188,
      "þ": 189,
      "ÿ": 190,
      "Ā": 191,
      "ā": 192,
      "Ă": 193,
      "ă": 194,
      "Ą": 195,
      "ą": 196,
      "Ć": 197,
      "ć": 198,
      "Ĉ": 199,
      "ĉ": 200,
      "Ċ": 201,
      "ċ": 202,
      "Č": 203,
      "č": 204,
      "Ď": 205,
      "ď": 206,
      "Đ": 207,
      "đ": 208,
      "Ē": 209,
      "ē": 210,
      "Ĕ": 211,
      "ĕ": 212,
      "Ė": 213,
      "ė": 214,
      "Ę": 215,
      "ę": 216,
      "Ě": 217,
      "ě": 218,
      "Ĝ": 219,
      "ĝ": 220,
      "Ğ": 221,
      "ğ": 222,
      "Ġ": 223,
      "ġ": 224,
      "Ģ": 225,
      "ģ": 226,
      "Ĥ": 227,
      "ĥ": 228,
      "Ħ": 229,
      "ħ": 230,
      "Ĩ": 231,
      "ĩ": 232,
      "Ī": 233,
      "ī": 234,
      "Ĭ": 235,
      "ĭ": 236,
      "Į": 237,
      "į": 238,
      "İ": 239,
      "ı": 240,
      "Ĳ": 241,
      "ĳ": 242,
      "Ĵ": 243,
      "ĵ": 244,
      "Ķ": 245,
      "ķ": 246,
      "ĸ": 247,
      "Ĺ": 248,
      "ĺ": 249,
      "Ļ": 250,
      "ļ": 251,
      "Ľ": 252,
      "ľ": 253,
      "Ŀ": 254,
      "ŀ": 255,
      "Ł": 256,
      "ł": 257,
      "Ń": 258,
      "Ġt": 259,
      "Ġth": 260,
      "an": 261,
      "Ġan": 262,
      "Ġand": 263,
      "Ġs": 264,
      "we": 265,
      "Ġ1": 266,
      "ve": 267,
      "ak": 268,
      "at": 269,
      "kn": 270,
      "mak": 271,
      "ow": 272,
      "Ġ+": 273,
      "Ġ=": 274,
      "Ġkn": 275,
      "Ġmak": 276,
      "Ġthat": 277,
      "Ġknow": 278,
      "Ġmake": 279,
      "Ġe": 280,
      "Ġf": 281,
      "Ġo": 282,
      "ne": 283,
      "ee": 284,
      "eve": 285,
      "even": 286,
      "al": 287,
      "is": 288,
      "lu": 289,
      "plu": 290,
      "qu": 291,
      "um": 292,
      "Ġis": 293,
      "Ġplu": 294,
      "Ġthe": 295,
      "Ġsum": 296,
      "Ġequ": 297,
      "Ġof": 298,
      "als": 299,
      "Ġplus": 300,
      "Ġequals": 301,
      "ou": 302,
      "our": 303,
      "Ġfi": 304,
      "ix": 305,
      "ine": 306,
      "nine": 307,
      "Ġ9": 308,
      "Ġfour": 309,
      "gh": 310,
      "igh": 311,
      "ight": 312,
      "Ġ4": 313,
      "Ġ6": 314,
      "Ġ5": 315,
      "Ġ8": 316,
      "Ġ7": 317,
      "Ġsix": 318,
      "Ġnine": 319,
      "Ġseven": 320,
      "Ġeight": 321,
      "Ġone": 322,
      "Ġfive": 323,
      "wo": 324,
      "Ġ2": 325,
      "ree": 326,
      "Ġ3": 327,
      "een": 328,
      "er": 329,
      "zer": 330,
      "Ġ0": 331,
      "zero": 332,
      "teen": 333,
      "Ġtwo": 334,
      "Ġthree": 335,
      "Ġzero": 336,
      "lve": 337,
      "Ġtwe": 338,
      "Ġ12": 339,
      "Ġtwelve": 340,
      "en": 341,
      "Ġten": 342,
      "Ġ10": 343,
      "ir": 344,
      "Ġthir": 345,
      "Ġ13": 346,
      "Ġthirteen": 347,
      "fteen": 348,
      "Ġ15": 349,
      "Ġfifteen": 350,
      "leven": 351,
      "Ġ11": 352,
      "Ġeleven": 353,
      "Ġ14": 354,
      "Ġfourteen": 355,
      "eight": 356,
      "fi": 357,
      "four": 358,
      "hree": 359,
      "one": 360,
      "seven": 361,
      "six": 362,
      "two": 363,
      "three": 364,
      "five": 365,
      "Ġ16": 366,
      "Ġ17": 367,
      "Ġsixteen": 368,
      "Ġseventeen": 369,
      "Ġ18": 370,
      "Ġeighteen": 371
    },
    "merges": [
      [
        "Ġ",
        "t"
      ],
      [
        "Ġt",
        "h"
      ],
      [
        "a",
        "n"
      ],
      [
        "Ġ",
        "an"
      ],
      [
        "Ġan",
        "d"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "w",
        "e"
      ],
      [
        "Ġ",
        "1"
      ],
      [
        "v",
        "e"
      ],
      [
        "a",
        "k"
      ],
      [
        "a",
        "t"
      ],
      [
        "k",
        "n"
      ],
      [
        "m",
        "ak"
      ],
      [
        "o",
        "w"
      ],
      [
        "Ġ",
        "+"
      ],
      [
        "Ġ",
        "="
      ],
      [
        "Ġ",
        "kn"
      ],
      [
        "Ġ",
        "mak"
      ],
      [
        "Ġth",
        "at"
      ],
      [
        "Ġkn",
        "ow"
      ],
      [
        "Ġmak",
        "e"
      ],
      [
        "Ġ",
        "e"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "n",
        "e"
      ],
      [
        "e",
        "e"
      ],
      [
        "e",
        "ve"
      ],
      [
        "eve",
        "n"
      ],
      [
        "a",
        "l"
      ],
      [
        "i",
        "s"
      ],
      [
        "l",
        "u"
      ],
      [
        "p",
        "lu"
      ],
      [
        "q",
        "u"
      ],
      [
        "u",
        "m"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "Ġ",
        "plu"
      ],
      [
        "Ġth",
        "e"
      ],
      [
        "Ġs",
        "um"
      ],
      [
        "Ġe",
        "qu"
      ],
      [
        "Ġo",
        "f"
      ],
      [
        "al",
        "s"
      ],
      [
        "Ġplu",
        "s"
      ],
      [
        "Ġequ",
        "als"
      ],
      [
        "o",
        "u"
      ],
      [
        "ou",
        "r"
      ],
      [
        "Ġf",
        "i"
      ],
      [
        "i",
        "x"
      ],
      [
        "i",
        "ne"
      ],
      [
        "n",
        "ine"
      ],
      [
        "Ġ",
        "9"
      ],
      [
        "Ġf",
        "our"
      ],
      [
        "g",
        "h"
      ],
      [
        "i",
        "gh"
      ],
      [
        "igh",
        "t"
      ],
      [
        "Ġ",
        "4"
      ],
      [
        "Ġ",
        "6"
      ],
      [
        "Ġ",
        "5"
      ],
      [
        "Ġ",
        "8"
      ],
      [
        "Ġ",
        "7"
      ],
      [
        "Ġs",
        "ix"
      ],
      [
        "Ġ",
        "nine"
      ],
      [
        "Ġs",
        "even"
      ],
      [
        "Ġe",
        "ight"
      ],
      [
        "Ġo",
        "ne"
      ],
      [
        "Ġfi",
        "ve"
      ],
      [
        "w",
        "o"
      ],
      [
        "Ġ",
        "2"
      ],
      [
        "r",
        "ee"
      ],
      [
        "Ġ",
        "3"
      ],
      [
        "ee",
        "n"
      ],
      [
        "e",
        "r"
      ],
      [
        "z",
        "er"
      ],
      [
        "Ġ",
        "0"
      ],
      [
        "zer",
        "o"
      ],
      [
        "t",
        "een"
      ],
      [
        "Ġt",
        "wo"
      ],
      [
        "Ġth",
        "ree"
      ],
      [
        "Ġ",
        "zero"
      ],
      [
        "l",
        "ve"
      ],
      [
        "Ġt",
        "we"
      ],
      [
        "Ġ1",
        "2"
      ],
      [
        "Ġtwe",
        "lve"
      ],
      [
        "e",
        "n"
      ],
      [
        "Ġt",
        "en"
      ],
      [
        "Ġ1",
        "0"
      ],
      [
        "i",
        "r"
      ],
      [
        "Ġth",
        "ir"
      ],
      [
        "Ġ1",
        "3"
      ],
      [
        "Ġthir",
        "teen"
      ],
      [
        "f",
        "teen"
      ],
      [
        "Ġ1",
        "5"
      ],
      [
        "Ġfi",
        "fteen"
      ],
      [
        "l",
        "even"
      ],
      [
        "Ġ1",
        "1"
      ],
      [
        "Ġe",
        "leven"
      ],
      [
        "Ġ1",
        "4"
      ],
      [
        "Ġfour",
        "teen"
      ],
      [
        "e",
        "ight"
      ],
      [
        "f",
        "i"
      ],
      [
        "f",
        "our"
      ],
      [
        "h",
        "ree"
      ],
      [
        "o",
        "ne"
      ],
      [
        "s",
        "even"
      ],
      [
        "s",
        "ix"
      ],
      [
        "t",
        "wo"
      ],
      [
        "t",
        "hree"
      ],
      [
        "fi",
        "ve"
      ],
      [
        "Ġ1",
        "6"
      ],
      [
        "Ġ1",
        "7"
      ],
      [
        "Ġsix",
        "teen"
      ],
      [
        "Ġseven",
        "teen"
      ],
      [
        "Ġ1",
        "8"
      ],
      [
        "Ġeight",
        "een"
      ]
    ]
  }
}